## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| update   | `aws_ecs_service.wordpress_service`                          |
|          | `aws_iam_policy.wordpress_ecs_task_get_secret_value`         |
| recreate | `aws_ecs_task_definition.wordpress_task`                     |
|          | `aws_secretsmanager_secret_version.c3_aws_access_key_id`     |
|          | `aws_secretsmanager_secret_version.c3_aws_secret_access_key` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/gc-articles/actions/runs/8227543178).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy",
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "${APACHE_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "apache"
                  + portMappings     = [
                      + {
                          + containerPort = 443
                          + hostPort      = 443
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = [
                      + {
                          + readOnly        = true
                          + sourceContainer = "wordpress"
                        },
                    ]
                },
              + {
                  + environment      = [
                      + {
                          + name  = "DEFAULT_DOMAIN"
                          + value = "${DEFAULT_DOMAIN}"
                        },
                      + {
                          + name  = "S3_UPLOADS_BUCKET_URL"
                          + value = "${S3_UPLOADS_BUCKET_URL}"
                        },
                      + {
                          + name  = "WORDPRESS_CONFIG_EXTRA"
                          + value = "${WORDPRESS_CONFIG_EXTRA}"
                        },
                      + {
                          + name  = "C3_DISTRIBUTION_ID"
                          + value = "${C3_DISTRIBUTION_ID}"
                        },
                    ]
                  + essential        = true
                  + image            = "${WORDPRESS_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "wordpress"
                  + portMappings     = [
                      + {
                          + containerPort = 9000
                          + hostPort      = 9000
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "LIST_MANAGER_ENDPOINT"
                          + valueFrom = "${LIST_MANAGER_ENDPOINT}"
                        },
                      + {
                          + name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          + valueFrom = "${DEFAULT_LIST_MANAGER_API_KEY}"
                        },
                      + {
                          + name      = "DEFAULT_NOTIFY_API_KEY"
                          + valueFrom = "${DEFAULT_NOTIFY_API_KEY}"
                        },
                      + {
                          + name      = "ENCRYPTION_KEY"
                          + valueFrom = "${ENCRYPTION_KEY}"
                        },
                      + {
                          + name      = "S3_UPLOADS_BUCKET"
                          + valueFrom = "${S3_UPLOADS_BUCKET}"
                        },
                      + {
                          + name      = "S3_UPLOADS_KEY"
                          + valueFrom = "${S3_UPLOADS_KEY}"
                        },
                      + {
                          + name      = "S3_UPLOADS_SECRET"
                          + valueFrom = "${S3_UPLOADS_SECRET}"
                        },
                      + {
                          + name      = "C3_AWS_ACCESS_KEY_ID"
                          + valueFrom = "${C3_AWS_ACCESS_KEY_ID}"
                        },
                      + {
                          + name      = "C3_AWS_SECRET_ACCESS_KEY"
                          + valueFrom = "${C3_AWS_SECRET_ACCESS_KEY}"
                        },
                      + {
                          + name      = "JWT_AUTH_SECRET_KEY"
                          + valueFrom = "${JWT_AUTH_SECRET_KEY}"
                        },
                      + {
                          + name      = "WPML_SITE_KEY"
                          + valueFrom = "${WPML_SITE_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_HOST"
                          + valueFrom = "${WORDPRESS_DB_HOST}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_USER"
                          + valueFrom = "${WORDPRESS_DB_USER}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_PASSWORD"
                          + valueFrom = "${WORDPRESS_DB_PASSWORD}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_NAME"
                          + valueFrom = "${WORDPRESS_DB_NAME}"
                        },
                      + {
                          + name      = "WORDPRESS_AUTH_KEY"
                          + valueFrom = "${WORDPRESS_AUTH_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_SECURE_AUTH_KEY"
                          + valueFrom = "${WORDPRESS_SECURE_AUTH_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_LOGGED_IN_KEY"
                          + valueFrom = "${WORDPRESS_LOGGED_IN_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_NONCE_KEY"
                          + valueFrom = "${WORDPRESS_NONCE_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_AUTH_SALT"
                          + valueFrom = "${WORDPRESS_AUTH_SALT}"
                        },
                      + {
                          + name      = "WORDPRESS_SECURE_AUTH_SALT"
                          + valueFrom = "${WORDPRESS_SECURE_AUTH_SALT}"
                        },
                      + {
                          + name      = "WORDPRESS_LOGGED_IN_SALT"
                          + valueFrom = "${WORDPRESS_LOGGED_IN_SALT}"
                        },
                      + {
                          + name      = "WORDPRESS_NONCE_SALT"
                          + valueFrom = "${WORDPRESS_NONCE_SALT}"
                        },
                      + {
                          + name      = "ZENDESK_API_URL"
                          + valueFrom = "${ZENDESK_API_URL}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "APACHE_IMAGE"                 = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.1.1"
          + "AWS_LOGS_GROUP"               = "/aws/ecs/wordpress"
          + "AWS_LOGS_REGION"              = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"       = "wordpress-task"
          + "C3_AWS_ACCESS_KEY_ID"         = (known after apply)
          + "C3_AWS_SECRET_ACCESS_KEY"     = (known after apply)
          + "C3_DISTRIBUTION_ID"           = "E355EOO70XE75H"
          + "DEFAULT_DOMAIN"               = "articles.cdssandbox.xyz"
          + "DEFAULT_LIST_MANAGER_API_KEY" = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA"
          + "DEFAULT_NOTIFY_API_KEY"       = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F"
          + "ENABLE_EFS"                   = "false"
          + "ENCRYPTION_KEY"               = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR"
          + "JWT_AUTH_SECRET_KEY"          = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu"
          + "LIST_MANAGER_ENDPOINT"        = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
          + "S3_UPLOADS_BUCKET"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn"
          + "S3_UPLOADS_BUCKET_URL"        = "https://articles.cdssandbox.xyz"
          + "S3_UPLOADS_KEY"               = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn"
          + "S3_UPLOADS_SECRET"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn"
          + "WORDPRESS_AUTH_KEY"           = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
          + "WORDPRESS_AUTH_SALT"          = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
          + "WORDPRESS_CONFIG_EXTRA"       = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
          + "WORDPRESS_DB_HOST"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
          + "WORDPRESS_DB_NAME"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
          + "WORDPRESS_DB_PASSWORD"        = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
          + "WORDPRESS_DB_USER"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
          + "WORDPRESS_IMAGE"              = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v3.15.0"
          + "WORDPRESS_LOGGED_IN_KEY"      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
          + "WORDPRESS_LOGGED_IN_SALT"     = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
          + "WORDPRESS_NONCE_KEY"          = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
          + "WORDPRESS_NONCE_SALT"         = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
          + "WORDPRESS_SECURE_AUTH_KEY"    = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
          + "WORDPRESS_SECURE_AUTH_SALT"   = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
          + "WPML_SITE_KEY"                = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z"
          + "ZENDESK_API_URL"              = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy"
        }
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:217" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:217" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.1.1"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "C3_DISTRIBUTION_ID"
                          - value = "E355EOO70XE75H"
                        },
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "S3_UPLOADS_BUCKET_URL"
                          - value = "https://articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v3.15.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "C3_AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT"
                        },
                      - {
                          - name      = "C3_AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_secret_access_key_9tv4ch-71ncKV"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR"
                        },
                      - {
                          - name      = "JWT_AUTH_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu"
                        },
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
                        },
                      - {
                          - name      = "WPML_SITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z"
                        },
                      - {
                          - name      = "ZENDESK_API_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 217 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::729164266357:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_secret_access_key_9tv4ch-71ncKV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.c3_aws_access_key_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "c3_aws_access_key_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT|D19AB61A-76E0-4569-BD1C-8530D78553B2" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "D19AB61A-76E0-4569-BD1C-8530D78553B2" -> (known after apply)
      ~ version_stages = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.c3_aws_secret_access_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "c3_aws_secret_access_key" {
      ~ arn            =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.wordpress_ecs_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.wordpress_service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.wordpress_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_ecr_image"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_secret_value"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.wordpress_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_access_key_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_secret_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_list_manager_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.encryption_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.jwt_auth_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.list_manager_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
